---
kind: property
id: P:Autodesk.Revit.DB.ScheduleField.HasSchedulableField
source: html/263d2b9f-68e3-48a1-5757-4700ba3b1e73.htm
---
# Autodesk.Revit.DB.ScheduleField.HasSchedulableField Property

Identifies if this ScheduleField object has access to a SchedulableField.
 Calculated and combined parameter fields will not have the access.

## Syntax (C#)
```csharp
public bool HasSchedulableField { get; }
```